package com.cpvcourse;

public class CourseConstant {
    public static final String[] BOOKS = {"资产评估基础", "资产评估相关知识", "资产评估实务(一)", "资产评估实务(二)"};
    public static final String[][] CHAPTERS = {
            {"第一章 资产评估概述", "第二章 资产评估的基础理论", "第三章 资产评估基本事项", "第四章 资产评估程序", "第五章 资产评估方法", "第六章 资产评估报告与档案", "第七章 资产评估准则", "第八章 资产评估的职业道德与法律责任", "第九章 我国资产评估行业的发展与监管"}, {"第一部分第一章 总论", "第一部分第二章 资产", "第一部分第三章 负债", "第一部分第四章 所有者权益", "第一部分第五章 收入、费用和利润", "第一部分第六章 财务报告", "第二部分第一章 财务管理基础", "第二部分第二章 财务分析", "第二部分第三章 预测与预算", "第二部分第四章 投资管理", "第二部分第五章 筹资与分配管理", "第二部分第六章 营运资金管理", "第三部分第一章 企业法律制度", "第三部分第二章 物权法律制度", "第三部分第三章 土地、矿产、森林和房地产法律制度", "第三部分第四章 知识产权法律制度", "第三部分第五章 金融法律制度", "第三部分第六章 企业国有资产法律制度", "第三部分第七章 税收法律制度"}, {"第一章 流动资产评估", "第二章 长期投资性资产评估", "第三章 机器设备评估", "第四章 建(构)筑物及在建工程评估", "第五章 资源资产评估", "第六章 其他长期性资产及负债评估", "第七章 以账务报告为目的的评估", "第八章 其他资产评估业务介绍"}, {"第一部分第一章 企业价值评估概述", "第一部分第二章 企业价值评估信息的收集和分析", "第一部分第三章 收益法在企业价值评估中的应用", "第一部分第四章 市场法在企业价值评估中的应用", "第一部分第五章 资产基础法在企业价值评估中的应用", "第二部分第一章 无形资产评估概述", "第二部分第二章 无形资产评估程序", "第二部分第三章 收益法在无形资产评估中的应用", "第二部分第四章 市场法和成本法在无形资产评估中的应用", "第二部分第五章 专利资产评估", "第二部分第六章 商标资产评估", "第二部分第七章 著作权资产评估", "第二部分第八章 商誉评估"}};
    public static final String[][] CHAPTERS_URL = {{"aa.png", "ab.png", "ac.png", "ad.png", "ae.png", "af.png", "ag.png", "ah.png", "ai.png"},
            {"ba.png", "bb.png", "bc.png", "bd.png", "be.png", "bf.png", "bg.png", "bh.png", "bi.png", "bj.png", "bk.png", "bl.png", "bm.png", "bn.png", "bo.png", "bp.png", "bq.png", "br.png", "bs.png"},
            {"ca.png", "cb.png", "cc.png", "cd.png", "ce.png", "cf.png", "cg.png", "ch.png"},
            {"da.png", "db.png", "dc.png", "dd.png", "de.png", "df.png", "dg.png", "dh.png", "di.png", "dj.png", "dk.png", "dl.png", "dm.png"}};
}
